Repository: Beldex-Coin/beldex-flutter-wallet
Catalog: lib/l10n/intl_*.arb
Languages: fr

source: Account already exist
fr: Le compte existe déja

source: Transaction initiated successfully
fr: Transaction initiée avec succès

source: Enter a valid sub address
fr: Entrez une sous-adresse valide

source: Subaddress already exist
fr: La sous-adresse existe déjà

source: Label name
fr: Nom de l'étiquette

source: Sub Address
fr: Sous-adresse

source: Loading the wallet...
fr: Chargement du portefeuille...

# youAreAboutToDeletenYourWallet
source: You are about to delete your wallet!
fr: Vous êtes sur le point de supprimer ton portefeuille!

source: Creating the Transaction
fr: Création de la transaction

source: Copy and save the seed to continue
fr: Copiez et enregistrez la graine pour continuer

source: Enter PIN
fr: Entrez le code PIN

source: Success
fr: Succès

source: Connection Failed
fr: La connexion a échoué

source: Checking...
fr: Vérification...

source: Test Result:
fr: Résultat du test:

source: Password (optional)
fr: Mot de passe (facultatif)

source: User Name (optional)
fr: Nom d'utilisateur (facultatif)

source: Node Name (optional)
fr: Nom du nœud (facultatif)

source: Add Node
fr: Ajouter un nœud

source: Legal Disclaimer
fr: Avertissement légal

# howCanWenhelpYou
source: How can we help you?
fr: Comment pouvons-nous T'aider?

source: Remove Contact
fr: Supprimer contact

source: Are you sure you want to remove selected contact?
fr: Êtes-vous sûr de vouloir supprimer le contact sélectionné?

source: The Address already Exist
fr: L'adresse existe déjà

source: This Name already Exist
fr: Ce nom existe déjà

source: Enter a valid name
fr: Entrez un nom valide

source: Name should not be empty
fr: Le nom ne doit pas être vide

source: Enter Name
fr: Entrez le nom

source: Account Name
fr: Nom du compte

source: Allow face id authentication
fr: Autoriser l'authentification par identification faciale

source: Enter Address
fr: Entrer l'adresse

source: Please add a mainnet node
fr: Veuillez ajouter un nœud de réseau principal

# flashTransactionPriority
source: Flash transaction are instant transactions. {transactionPriority} priority is set as a default fee.
fr: Les transactions flash sont des transactions instantanées. La priorité {transactionPriority} est définie comme frais par défaut.

# initiatingTransactionTitle
source: Initiating Transaction..
fr: Initier une transaction..

# initiatingTransactionDescription
source: Please don't close this window or navigate to another app until the transaction gets initiated
fr: Veuillez ne pas fermer cette fenêtre ni accéder à une autre application tant que la transaction n'a pas été initiée.

source: Sub Addresses
fr: Sous-adresses

# loadingTheWalletDescription
source: Please don't close this window or navigate to another app until we load the wallet
fr: Veuillez ne pas fermer cette fenêtre ni accéder à une autre application tant que nous n'avons pas chargé le portefeuille.

source: Buy BNS
fr: Acheter des BNS
