Repository: Beldex-Coin/beldex-flutter-wallet
Catalog: lib/l10n/intl_*.arb
Languages: fr

# welcome
source: Welcome to Beldex Wallet
fr: Bienvenu sur Beldex WALLET

# first_wallet_text
source: Awesome wallet for Beldex
fr: Super Wallet pour Beldex

# please_make_selection
source: Select from the options below to either create or recover your wallet.
fr: Veuillez faire un choix ci-dessous Créez ou restaurez votre portefeuille.

# create_new
source: Create New Wallet
fr: Créer un nouveau portefeuille

# restore_wallet
source: Use Existing Wallet
fr: Restaurer un portefeuille

source: Accounts
fr: Comptes

source: Edit
fr: Éditer

source: Account
fr: Compte

source: Add
fr: Ajouter

source: Address Book
fr: Carnet d'adresses

source: Please select:
fr: Veuillez sélectionner:

source: Cancel
fr: Annuler

source: Contact Name
fr: Nom du contact

source: Reset
fr: Réinitialiser

source: Save
fr: Sauvegarder

source: Authenticated
fr: Authentifié

source: Authentication
fr: Authentification

# failed_authentication
source: Failed authentication. {state_error}
fr: Échec de l'authentification. {state_error}

# wallet_menu
source: Menu
fr: Menu du portefeuille

# Blocks_remaining
source: {status} Blocks Remaining
fr: {status} blocs restants

source: Please try to connect to another node
fr: veuillez essayer de vous connecter à un autre node

source: Beldex Hidden
fr: Beldex caché

source: Beldex Available Balance
fr: Beldex solde disponible

source: Beldex Full Balance
fr: Beldex solde complet

source: Send
fr: envoyer

source: Receive
fr: recevoir

source: Incoming
fr: entrant

source: Outgoing
fr: sortant

source: Transactions by Date
fr: transactions par date

source: Filters
fr: filtres

source: Today
fr: aujourd'hui

source: Yesterday
fr: hier

source: Received
fr: a reçu

source: Sent
fr: expédié

source: (pending)
fr: (en attente)

source: Rescan
fr: réanalyser

source: Reconnect
fr: se reconnecter

source: Show Seed
fr: Afficher le seed

source: Show keys
fr: Afficher les clés

source: Reconnection
fr: reconnexion

# reconnect_alert_text
source: Are you sure to reconnect?
fr: Voulez-vous vraiment vous reconnecter?

# reload_fiat
source: Reload Fiat data
fr: Actualiser le taux fiat

source: Clear
fr: clair

source: Error
fr: erreur

source: Copied to clipboard!
fr: Copié dans le presse-papiers

source: Fetching
fr: Récupération

source: Amount
fr: Montant:

source: Status:
fr: Statut:

source: Confirm
fr: confirmer

source: Confirm sending
fr: confirmer l'envoi

# commit_transaction_amount_fee
source: Commit transaction Amount: {amount} Fee: {fee}
fr: Valider la transaction Montant: {amount} Fee: {fee}

source: Sending
fr: Envoyer

source: Transaction sent!
fr: Transaction envoyé!

source: Send Beldex
fr: Envoyer Beldex

source: Changelog
fr: Journal des modifications

source: Loading your wallet
fr: chargement du portefeuille

source: New Wallet
fr: Nouveau portefeuille

source: Wallet Name
fr: Nom du portefeuille

# continue_text
source: Continue
fr: Continuez

# node_new
source: New Node
fr: Nouveau Node

source: Node Address
fr: L'adresse du Node

source: Node Port
fr: Port du Node

source: Password
fr: Mot de Passe

# node_reset_settings_title
source: Reset settings
fr: Réinitialiser les paramètres

# nodes_list_reset_to_default_message
source: Are you sure that you want to reset settings to default?
fr: Êtes-vous sûr de vouloir réinitialiser les paramètres par défaut?

# change_current_node
source: Are you sure to change current node to {node}?
fr: Voulez-vous vraiment changer le Node actuel vers {node}?

source: Change
fr: Changement

source: Remove node
fr: supprimer le Node

# remove_node_message
source: Are you sure that you want to remove selected node?
fr: Vous voulez vraiment supprimer le Node sélectionné?

source: Remove
fr: supprimer

source: Delete
fr: effacer

# use
source: Switch to
fr: Basculer vers

source: -digit PIN
fr: -chiffre PIN

source: Share address
fr: Partager l'adresse

# receive_amount
source: Amount
fr: Montant

source: Subaddresses
fr: Sous-adresses

# restore_restore_wallet
source: Restore Wallet
fr: Restauration du portefeuille

# restore_title_from_seed_keys
source: Restore from seed/keys
fr: Restaurer à partir du seed ou des clés

# restore_description_from_seed_keys
source: Get back your wallet from seed/keys that you've saved to secure place
fr: Restaurez votre portefeuille avec le Seed ou les clées que vous avez conservées dans un endroit sûr

# restore_next
source: Next
fr: Continuer

# restore_title_from_backup
source: Restore from a back-up file
fr: Restaurer à partir d'un fichier de sauvegarde

# restore_description_from_backup
source: You can restore the whole Beldex Wallet app from your back-up file
fr: Vous pouvez restaurer l'intégralité de l'application Beldex Wallet à partir de son fichier de sauvegarde.

# restore_seed_keys_restore
source: Seed/Keys Restore
fr: Restaurer depuis le Seed ou les clés

# restore_title_from_seed
source: Restore from Seed
fr: Restaurer à partir du Seed

# restore_description_from_seed
source: Use the 25-word Mnemonic Key or Seed Phrase to Restore your Wallet.
fr: Utilisez la clé mnémotechnique de 25 mots ou la phrase de départ pour restaurer votre portefeuille.

# restore_title_from_keys
source: Restore from Keys
fr: Récupération des clés

# restore_description_from_keys
source: Use the generated keystrokes saved from private keys to Restore your Wallet
fr: Utilisez les frappes générées enregistrées à partir de clés privées pour restaurer votre portefeuille

# restore_wallet_name
source: Wallet Name
fr: Nom du portefeuille

# restore_address
source: Address
fr: Adresse

# restore_view_key_private
source: View key (private)
fr: Clé d'observation (secret)

# restore_spend_key_private
source: Spend key (private)
fr: Clé de dépense (secret)

# restore_recover
source: Restore
fr: Restaurer

# restore_wallet_restore_description
source: Wallet restore description
fr: Description de la restauration du portefeuille

# seed_share
source: Share seed
fr: Partager Seed

source: Copy
fr: copier

# seed_language_choose
source: Please choose a seed language
fr: Veuillez sélectionner la langue source

# seed_language_next
source: Next
fr: Continuer

# seed_language_english
source: English
fr: Anglais

# seed_language_chinese
source: Chinese
fr: Chinois

# seed_language_dutch
source: Dutch
fr: Néerlandais

# seed_language_german
source: German
fr: Allemand

# seed_language_japanese
source: Japanese
fr: Japonais

# seed_language_portuguese
source: Portuguese
fr: Portugais

# seed_language_russian
source: Russian
fr: Russe

# seed_language_spanish
source: Spanish
fr: Espagnol

# seed_language_french
source: French
fr: Français

# seed_language_italian
source: Italian
fr: Italien

# send_title
source: Send
fr: Envoyer des

# send_your_wallet
source: Your wallet
fr: Votre portefeuille

# send_beldex_address
source: Beldex address or BNS name
fr: Adresse Beldex

source: ALL
fr: TOUT

# send_error_currency
source: Currency can only contain numbers
fr: La devise ne peut contenir que des nombres

# send_estimated_fee
source: Estimated Fee:
fr: Frais estimés:

# send_priority
source: {transactionPriority} priority is set as the default fee. Go to setting to change the transaction priority.
fr: {transactionPriority} la priorité est définie comme frais par défaut. Accédez au paramètre pour modifier la priorité de la transaction.

# send_creating_transaction
source: Creating transaction
fr: Créer une transaction

# title_new_stake
source: New Stake
fr: Nouveau Stake

source: Your Contributions
fr: Vos contributions

source: Start staking
fr: Commencer le staking

source: Stake more
fr: Staker plus

# nothing_staked
source: Nothing staked yet
fr: Aucune contribution pour le moment

# service_node_key
source: Master Node Key
fr: Clé de nœud de service

# title_confirm_unlock_stake
source: Unlock Stake
fr: Déverrouiller Stake

# body_confirm_unlock_stake
source: Do you really want to unlock your stake from {masterNodeKey}?
fr: Voulez-vous vraiment débloquer votre mise de{masterNodeKey}?

# unlock_stake_requested
source: Stake unlock requested
fr: Déverrouillage du Stake demandé

# unable_unlock_stake
source: Unable to unlock stake
fr: Impossible de déverrouiller le Stake

# settings_title
source: Settings
fr: Paramètres

# settings_nodes
source: Nodes
fr: Node

# settings_current_node
source: Current node
fr: Node actuel

# settings_wallets
source: Wallets
fr: Portefeuilles

# settings_display_balance_as
source: Display Balance As
fr: Afficher la balance comme

# settings_balance_detail
source: Decimals
fr: Décimales

# settings_currency
source: Currency
fr: Devise

# settings_fee_priority
source: Fee Priority
fr: Priorité des frais

# settings_save_recipient_address
source: Save recipient address
fr: Enregistrer l'adresse du destinataire

# settings_personal
source: Personal
fr: personnel

# settings_change_pin
source: Change PIN
fr: changer le code PIN

# settings_change_language
source: Select Language
fr: changer de langue

# settings_allow_biometric_authentication
source: Allow biometric authentication
fr: Authentification biométrique

# settings_dark_mode
source: Dark mode
fr: Mode Sombre

# settings_display_on_dashboard_list
source: Display on dashboard list
fr: Afficher dans la liste du tableau de bord

# settings_all
source: ALL
fr: TOUT

# settings_none
source: None
fr: Rien

# settings_support
source: Support
fr: Soutien

# settings_terms_and_conditions
source: Terms & Conditions
fr: Termes et conditions

# settings_enable_fiat_currency
source: Enable Fiat Currency conversion
fr: Convertir la devise en fiat

source: PIN is incorrect
fr: Le code PIN est faux

# amount_detail_none
source: 0 - None
fr: 0 - Aucun

# amount_detail_detailed
source: 4 - Detailed
fr: 4 - Détaillé

source: Setup PIN
fr: Configurer le code PIN

source: Re-Enter your PIN
fr: Entrez à nouveau votre code PIN

# setup_successful
source: Your PIN has been set up successfully!
fr: Votre code PIN a été configuré avec succès!

source: Wallet keys
fr: Clés du portefeuille

source: View key (private)
fr: Clé d'observation (secret)

source: View key (public)
fr: Clé d'observation (publique)

source: Spend key (private)
fr: Clé de dépense (secret)

source: Spend key (public)
fr: Clé de dépense (publique)

source: Copied {key} to Clipboard
fr: Clé {key} dans le presse-papiers

# new_subaddress_title
source: New subaddress
fr: Nouvelle sous-adresse

# new_subaddress_label_name
source: Label name
fr: Nom

# new_subaddress_create
source: Create
fr: Créer

# subaddress_title
source: Subaddress list
fr: Liste des sous-adresses

# transaction_details_title
source: Transaction Details
fr: détails de la transaction

# transaction_details_transaction_id
source: Transaction ID
fr: ID Transaction

# transaction_details_height
source: Height
fr: Taille

# transaction_details_amount
source: Amount
fr: Montant

# transaction_details_copied
source: {title} copied to Clipboard
fr: {title} copié dans le presse-papiers

# transaction_details_recipient_address
source: Recipient Address
fr: Adresse du destinataire

# wallet_list_create_new_wallet
source: Create New Wallet
fr: Créer un nouveau portefeuille

# wallet_list_restore_wallet
source: Use Existing Wallet
fr: Restaurer le portefeuille

# wallet_list_load_wallet
source: Load wallet
fr: Charger le portefeuille

# wallet_list_loading_wallet
source: Loading {wallet_name} wallet
fr: chargement du {wallet_name} wallet

# wallet_list_failed_to_load
source: Failed to load {wallet_name} wallet. {error}
fr: Échec du chargement du portefeuille {wallet_name}. {error}

# wallet_list_removing_wallet
source: Removing {wallet_name} wallet
fr: Wallet {wallet_name}

# wallet_list_failed_to_remove
source: Failed to remove {wallet_name} wallet. {error}
fr: Erreur lors de la suppression {wallet_name} Wallet. {error}

# widgets_address
source: Address
fr: Adresse

# widgets_restore_from_blockheight
source: Restore from Blockheight
fr: restaurer à partir du blockheight

# widgets_restore_from_date
source: Restore from Date
fr: Restaurer à partir de la date

# widgets_or
source: OR
fr: ou

# router_no_route
source: No route defined for {name}
fr: Aucun itinéraire défini pour {name}

# error_text_account_name
source: Account name can only contain letters, numbers and must be between 1 and 15 characters long
fr: Le nom du compte ne peut contenir que des lettres et des chiffres et doit comporter entre 1 et 15 caractères

# error_text_contact_name
source: Contact name can't contain ` , ' " symbols and must be between 1 and 32 characters long
fr: Dans le nom du contact, les symboles ` , ' " ne doivent pas être inclus et doit comporter entre 1 et 32 ​​caractères

# error_text_node_address
source: Please enter a iPv4 address
fr: Veuillez saisir une adresse iPv4

# error_text_node_port
source: Node port can only contain numbers between 0 and 65535
fr: Le port du Node ne peut contenir que des nombres compris entre 0 et 65535

# error_text_payment_id
source: Payment ID can only contain from 16 to 64 chars in hex
fr: L'ID de paiement ne peut contenir que 16 à 64 caractères hexadécimaux

# error_text_beldex
source: Beldex value can't exceed available balance. The number of fraction digits must be less or equal to 9
fr: La valeur Beldex ne peut pas dépasser le solde disponible. Le nombre de décimales doit être inférieur ou égal à 9

# error_text_fiat
source: Value of amount can't exceed available balance. The number of fraction digits must be less or equal to 2
fr: La valeur du montant ne peut pas dépasser le solde disponible du compte. Le nombre de décimales doit être inférieur ou égal à 2

# error_text_subaddress_name
source: Subaddress name can't contain ` , ' " symbols and must be between 1 and 20 characters long
fr: Au nom de la sous-adresse, les symboles ` , ' " ne pas être inclus et doit comporter entre 1 et 20 caractères

# error_text_amount
source: Amount can only contain numbers
fr: Le montant ne peut contenir que des nombres

# error_text_wallet_name
source: Wallet name can only contain letters, numbers and must be between 1 and 15 characters long
fr: Le nom du portefeuille ne peut contenir que des lettres et des chiffres et doit comporter entre 1 et 15 caractères

# error_text_keys
source: Wallet keys can only contain 64 chars in hex
fr: Les clés de portefeuille ne peuvent contenir que 64 caractères hexadécimaux

# error_text_crypto_currency
source: The number of fraction digits must be less or equal to 12
fr: Le nombre de décimales m doit être inférieur ou égal à 12.

# error_text_service_node
source: A Master Node key can only contain 64 chars in hex
fr: Une clé de nœud de service ne peut contenir que 64 caractères maximum

# auth_store_ban_timeout
source: ban_timeout
fr: Interdire le délai d'expiration

# auth_store_banned_for
source: Banned for
fr: Interdit pour

# auth_store_banned_minutes
source: minutes
fr: Protocole

# auth_store_incorrect_password
source: Wrong PIN
fr: mauvais code PIN

# wallet_restoration_store_incorrect_seed_length
source: Incorrect seed length
fr: mauvaise longueur du Seed

source: Full Balance
fr: Solde complet

source: Available Balance
fr: Solde disponible

source: Hidden Balance
fr: solde caché

# sync_status_synchronizing
source: SYNCHRONIZING
fr: SYNCHRONISATION

# sync_status_synchronized
source: SYNCHRONIZED
fr: SYNCHRONISÉ

# sync_status_not_connected
source: NOT CONNECTED
fr: PAS CONNECTÉ

# sync_status_starting_sync
source: STARTING SYNC
fr: DÉBUT DE LA SYNCHRONISATION

# sync_status_failed_connect
source: FAILED CONNECT TO THE NODE
fr: ÉCHEC DE LA CONNEXION AU NODE

# sync_status_connecting
source: CONNECTING
fr: CONNEXION

# sync_status_connected
source: CONNECTED
fr: CONNECTÉ

# transaction_priority_slow
source: Slow
fr: Lente

source: Change Language
fr: changer la langue

# change_language_to
source: Change language to {language}?
fr: Changez la langue en {language}?

source: Paste
fr: Coller

# restore_from_seed_placeholder
source: Please enter or paste your seed here
fr: Veuillez entrer votre code ici

source: Add new word
fr: Ajouter un nouveau mot

# incorrect_seed
source: The text entered is not valid.
fr: Le texte saisi n'est pas valide.

# biometric_auth_reason
source: Scan your fingerprint to authenticate
fr: Scannez votre empreinte digitale pour l'authentification

# openalias_alert_title
source: Beldex Recipient Detected
fr: Beldex-destinataire reconnu

# openalias_alert_content
source: You will be sending funds to {recipient_name}
fr: Vous envoyez de l'argent à {recipient_name}

source: Dangerzone
fr: zone de danger

source: Yes, I'm sure!
fr: Oui, je suis sûr!

# never_give_your
source: Never Give your Beldex Wallet {item} to Anyone!
fr: Ne donnez JAMAIS votre Wallet Beldex à qui que ce soit! {item} à qui que ce soit!

# dangerzone_warning
source: NEVER input your Beldex wallet {item} into any software or website other than the OFFICIAL Beldex wallets downloaded directly from the {app_store}, the Beldex website, or the Beldex GitHub. Are you sure you want to access your wallet {item}?
fr: Ne JAMAIS saisir vos identifiants de votre Wallet Beldex {item} dans tout logiciel ou site Web autre que les portefeuilles OFFICIELS Beldex téléchargés directement à partir du {app_store}, le site internet Beldex, ou Beldex sur GitHub. Êtes-vous sûr de vouloir accéder à votre portefeuille {item}?

# keys_title
source: Keys
fr: Clés

source: Are you sure?
fr: Es-tu sûr?

source: Do you want to exit an App
fr: Voulez-vous quitter une application

source: No
fr: Non

source: Yes
fr: Oui

# byUsingThisAppYouAgreeToTheTermsOf
source: By using this app, you agree to the Terms of Agreement set forth to below
fr: En utilisant cette application, vous acceptez les termes de l'accord ci-dessous

source: I agree to Terms of Use
fr: J'accepte les conditions d'utilisation

source: Accept
fr: J'accepte

source: Please enter a valid amount
fr: Veuillez entrer un montant valide

source: Please enter a valid seed
fr: Veuillez saisir une graine valide

source: Change Wallet
fr: Changer de portefeuille

source: Remove Wallet
fr: Supprimer le portefeuille

source: Reconnect Wallet
fr: Reconnecter le portefeuille

source: Rescan Wallet
fr: Analyser à nouveau le portefeuille

source: Enter Wallet Name
fr: Entrez le nom du portefeuille

source: No transactions yet!
fr: Aucune transaction pour l'instant!

# afterYourFirstTransactionnYouWillBeAbleToView
source: After your first transaction, you will be able to view it here.
fr: Après votre première transaction, Vous pourrez le voir ici.

source: Copied
fr: Copié

source: Add Address
fr: Ajoutez l'adresse

source: IMPORTANT
fr: IMPORTANTE

# neverInputYourBeldexWalletItemIntoAnySoftwareOr
source: Never input your Beldex wallet {item} into any software or website other than the official Beldex wallets downloaded directly from the {appStore},the beldex website, or the beldex GitHub.
fr: Ne saisissez jamais votre portefeuille Beldex {item} dans un logiciel ou un site Web autre que \ n les portefeuilles Beldex officiels téléchargés directement depuis l '{appStore}, \ n le site Web beldex ou le GitHub beldex.

source: Enter wallet name
fr: Entrez le nom du portefeuille

source: Choose Seed Language
fr: Choisissez la langue de départ

source: Wallet
fr: Portefeuille

source: Seed & Keys
fr: Graines et clés

source: Wallet Address
fr: Adresse du portefeuille

source: Recovery Seed/Key
fr: Graine/clé de récupération

source: Select Language
fr: Choisir la langue

source: Choose Language
fr: Choisissez la langue

source: Welcome to Beldex Wallet :)
fr: Bienvenue sur le portefeuille Beldex :)

# selectAnOptionBelowToCreateOrnRecoverExistingWallet
source: Select an option below to create or recover existing wallet
fr: Sélectionnez une option ci-dessous pour créer ou Récupérer le portefeuille existant

source: Enter a valid name upto 15 characters
fr: Entrez un nom valide jusqu'à 15 caractères

source: Do you want to exit the wallet?
fr: Voulez-vous sortir du portefeuille?

# makeSureToBackupOfYournrecoverySeedWalletAddressnandPrivate
source: Make sure to take backup of your recovery Seed, wallet address and private keys
fr: Assurez-vous de faire une sauvegarde de votre graine de récupération, adresse du portefeuille et clés privées

# blockRemaining
source: {status} Block Remaining
fr: {status} Bloc restant

source: Flash Transaction
fr: Transaction flash

# transferYourBdxMoreFasternWithFlashTransaction
source: Transfer your BDX more faster with Flash Transaction!
fr: Transférez votre BDX plus rapidement avec Transaction Flash!

source: Enter Your PIN
fr: Entrez votre code PIN

source: Wallet Settings
fr: Paramètres du portefeuille

source: Recovery Seed
fr: Semence de récupération

source: You don't have enough unlocked balance
fr: Vous n'avez pas suffisamment de solde débloqué

source: Alert
fr: Alerte

source: Touch the Fingerprint sensor
fr: Touchez le capteur d'empreintes digitales

source: USE PATTERN
fr: UTILISER LE MODÈLE

source: Enter BDX to send
fr: Entrez BDX pour envoyer

source: Enter Amount
fr: Entrer le montant

source: Please enter a amount
fr: Veuillez saisir un montant

source: Committing the Transaction
fr: Validation de la transaction

source: Available BDX :
fr: BDX disponibles :

source: Please enter a bdx address
fr: Veuillez entrer une adresse bdx

source: Enter a valid address
fr: Entrez une adresse valide

source: Biometric feature currenly disabled.Kindly enable allow biometric authentication feature inside the app settings
fr: La fonctionnalité biométrique est actuellement désactivée. Veuillez activer la fonctionnalité d'authentification biométrique dans les paramètres de l'application.

source: Unlock Beldex Wallet
fr: Déverrouiller le portefeuille Beldex

source: Confirm your screen lock PIN,Pattern and password
fr: Confirmez votre code PIN, votre modèle et votre mot de passe de verrouillage d'écran

# doYouWantToChangeYournPrimaryAccount
source: Do you want to change your primary account?
fr: Voulez-vous modifier votre compte principal?

source: Rename
fr: Renommer

source: Add Account
fr: Ajouter un compte

source: No addresses in book
fr: Aucune adresse dans le carnets

# howeverWeRecommendToScanTheBlockchainFromTheBlock
source: However we recommend to scan the blockchain from the block height at which you created the wallet to get all transactions and correct balance
fr: Cependant, nous vous recommandons de scanner la blockchain à partir de la hauteur de bloc à laquelle vous avez créé le portefeuille pour obtenir toutes les transactions et corriger le solde.

source: You have scanned from the block height
fr: Vous avez scanné à partir de la hauteur du bloc

source: Sync info
fr: Informations de synchronisation

# doYouWantToReconnectnTheWallet
source: Do you want to reconnect the wallet?
fr: Voulez-vous vous reconnecter le porte-feuille?

source: Enter valid name upto 15 characters
fr: Entrez un nom valide jusqu'à 15 caractères

source: Checking node connection...
fr: Vérification de la connexion du nœud...

source: Enter BDX to Receive
fr: Entrez BDX pour recevoir

source: Add Sub Address
fr: Ajouter une sous-adresse

source: Share QR
fr: Partager le code QR

source: Name
fr: Nom

source: Enter valid height without space
fr: Entrez une hauteur valide sans espace

source: Date should not be empty
fr: La date ne doit pas être vide

source: Wallet Restore
fr: Restauration du portefeuille

source: You can't view the seed because you've restored using keys
fr: Vous ne pouvez pas afficher la graine, car vous avez effectué une restauration à l'aide de clés

# neverShareYourSeedToAnyoneCheckYourSurroundingsTo
source: Never share your seed to anyone! Check your surroundings to ensure no one is overlooking
fr: Ne partagez jamais votre graine avec qui que ce soit! Vérifiez votre environnement pour vous assurer que personne ne vous oublie

source: Copy Seed
fr: Copier la graine
